In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
df = pd.DataFrame({
    'id' : ['23', '96', '97', '15', '87'],
    'name' : ['computer', 'Python Workout', 'Pandas Workout', 'banana', 'sandwich'],
    'wholesale_price' : [500, 35, 35, 0.5, 3],
    'retail_price' : [1000, 75, 75, 1, 5],
    'sales' : [100, 1000, 500, 200, 300]
})

df

   id            name  wholesale_price  retail_price  sales
0  23        computer            500.0          1000    100
1  96  Python Workout             35.0            75   1000
2  97  Pandas Workout             35.0            75    500
3  15          banana              0.5             1    200
4  87        sandwich              3.0             5    300

In [3]:
tax_df = df.assign(current_net_revenue = (df['retail_price'] - df['wholesale_price']) * df['sales'])
# NOTE: the .assign method returns a new data frame rather than modifying an existing one

tax_df['after_15'] = tax_df['current_net_revenue'] * 0.85
tax_df['after_20'] = tax_df['current_net_revenue'] * 0.8
tax_df['after_25'] = tax_df['current_net_revenue'] * 0.75

tax_df

,id,name,wholesale_price,retail_price,sales,current_net_revenue,after_15,after_20,after_25
0,23,computer,500.0,1000,100,50000.0,42500.0,40000.0,37500.0
1,96,Python Workout,35.0,75,1000,40000.0,34000.0,32000.0,30000.0
2,97,Pandas Workout,35.0,75,500,20000.0,17000.0,16000.0,15000.0
3,15,banana,0.5,1,200,100.0,85.0,80.0,75.0
4,87,sandwich,3.0,5,300,600.0,510.0,480.0,450.0

In [4]:
tax_df[['current_net_revenue', 'after_15', 'after_20', 'after_25']].sum()

current_net_revenue    110700.0
after_15                94095.0
after_20                88560.0
after_25                83025.0
dtype: float64

### Beyond the exercise_1

In [7]:
# An alternative tax plan would charge a 25% tax, but only on products from
# which you would net more than 20,000. In such a case, how much would you make?

tax_df['conditional_25'] = tax_df['current_net_revenue'].apply(lambda x: x if x < 20000 else x * 0.75)

tax_df[['current_net_revenue', 'after_15', 'after_20', 'after_25', 'conditional_25']].sum()

current_net_revenue    110700.0
after_15                94095.0
after_20                88560.0
after_25                83025.0
conditional_25          83200.0
dtype: float64

### Beyond the exercise_2

In [11]:
# Yet another alternative tax plan would charge a 25% tax on products whose
# retail price is greater than 80, a 10% tax on products whose retail price is
# between 30 and 80, and no tax on other products. Implement and calculate the result of such a tax scheme.

def categorize(x):
    if x > 80:
        return x * 0.75
    elif x > 30 and x < 80:
        return x * 0.8
    else:
        return x

tax_df['condition_tax_2'] = (tax_df['retail_price'].apply(categorize) - tax_df['wholesale_price']) * df['sales']

tax_df[['current_net_revenue', 'after_15', 'after_20', 'after_25', 'conditional_25', 'condition_tax_2']].sum()

tax_df

,id,name,wholesale_price,retail_price,sales,current_net_revenue,after_15,after_20,after_25,conditional_25,condition_tax_2
0,23,computer,500.0,1000,100,50000.0,42500.0,40000.0,37500.0,37500.0,25000.0
1,96,Python Workout,35.0,75,1000,40000.0,34000.0,32000.0,30000.0,30000.0,25000.0
2,97,Pandas Workout,35.0,75,500,20000.0,17000.0,16000.0,15000.0,15000.0,12500.0
3,15,banana,0.5,1,200,100.0,85.0,80.0,75.0,100.0,100.0
4,87,sandwich,3.0,5,300,600.0,510.0,480.0,450.0,600.0,600.0